RIOT-OS/RIOT/drivers/cc3200sdk/inc/hw_mmchs.h
//*****************************************************************************
//
//  Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#ifndef __HW_MMCHS_H__
#define __HW_MMCHS_H__

//*****************************************************************************
//
// The following are defines for the MMCHS register offsets.
//
//*****************************************************************************
#define MMCHS_O_HL_REV          0x00000000  // IP Revision Identifier (X.Y.R)
// Used by software to track
// features bugs and compatibility
#define MMCHS_O_HL_HWINFO       0x00000004  // Information about the IP
// module's hardware configuration
// i.e. typically the module's HDL
// generics (if any). Actual field
// format and encoding is up to the
// module's designer to decide.
#define MMCHS_O_HL_SYSCONFIG    0x00000010  // Clock management configuration
#define MMCHS_O_SYSCONFIG       0x00000110  // System Configuration Register
// This register allows controlling
// various parameters of the OCP
// interface.
#define MMCHS_O_SYSSTATUS       0x00000114  // System Status Register This
// register provides status
// information about the module
// excluding the interrupt status
// information
#define MMCHS_O_CSRE            0x00000124  // Card status response error This
// register enables the host
// controller to detect card status
// errors of response type R1 R1b
// for all cards and of R5 R5b and
// R6 response for cards types SD or
// SDIO. When a bit MMCHS_CSRE[i] is
// set to 1 if the corresponding bit
// at the same position in the
// response MMCHS_RSP0[i] is set to
// 1 the host controller indicates a
// card error (MMCHS_STAT[CERR])
// interrupt status to avoid the
// host driver reading the response
// register (MMCHS_RSP0). Note: No
// automatic card error detection
// for autoCMD12 is implemented; the
// host system has to check
// autoCMD12 response register
// (MMCHS_RESP76) for possible card
// errors.
#define MMCHS_O_SYSTEST         0x00000128  // System Test register This
// register is used to control the
// signals that connect to I/O pins
// when the module is configured in
// system test (SYSTEST) mode for
// boundary connectivity
// verification. Note: In SYSTEST
// mode a write into MMCHS_CMD
// register will not start a
// transfer. The buffer behaves as a
// stack accessible only by the
// local host (push and pop
// operations). In this mode the
// Transfer Block Size
// (MMCHS_BLK[BLEN]) and the Blocks
// count for current transfer
// (MMCHS_BLK[NBLK]) are needed to
// generate a Buffer write ready
// interrupt (MMCHS_STAT[BWR]) or a
// Buffer read ready interrupt
// (MMCHS_STAT[BRR]) and DMA
// requests if enabled.
#define MMCHS_O_CON             0x0000012C  // Configuration register This
// register is used: - to select the
// functional mode or the SYSTEST
// mode for any card. - to send an
// initialization sequence to any
// card. - to enable the detection
// on DAT[1] of a card interrupt for
// SDIO cards only. and also to
// configure : - specific data and
// command transfers for MMC cards
// only. - the parameters related to
// the card detect and write protect
// input signals.
#define MMCHS_O_PWCNT           0x00000130  // Power counter register This
// register is used to program a mmc
// counter to delay command
// transfers after activating the
// PAD power this value depends on
// PAD characteristics and voltage.
#define MMCHS_O_BLK             0x00000204  // Transfer Length Configuration
// register MMCHS_BLK[BLEN] is the
// block size register.
// MMCHS_BLK[NBLK] is the block
// count register. This register
// shall be used for any card.
#define MMCHS_O_ARG             0x00000208  // Command argument Register This
// register contains command
// argument specified as bit 39-8 of
// Command-Format These registers
// must be initialized prior to
// sending the command itself to the
// card (write action into the
// register MMCHS_CMD register).
// Only exception is for a command
// index specifying stuff bits in
// arguments making a write
// unnecessary.
#define MMCHS_O_CMD             0x0000020C  // Command and transfer mode
// register MMCHS_CMD[31:16] = the
// command register MMCHS_CMD[15:0]
// = the transfer mode. This
// register configures the data and
// command transfers. A write into
// the most significant byte send
// the command. A write into
// MMCHS_CMD[15:0] registers during
// data transfer has no effect. This
// register shall be used for any
// card. Note: In SYSTEST mode a
// write into MMCHS_CMD register
// will not start a transfer.
#define MMCHS_O_RSP10           0x00000210  // Command response[31:0] Register
// This 32-bit register holds bits
// positions [31:0] of command
// response type
// R1/R1b/R2/R3/R4/R5/R5b/R6
#define MMCHS_O_RSP32           0x00000214  // Command response[63:32] Register
// This 32-bit register holds bits
// positions [63:32] of command
// response type R2
#define MMCHS_O_RSP54           0x00000218  // Command response[95:64] Register
// This 32-bit register holds bits
// positions [95:64] of command
// response type R2
#define MMCHS_O_RSP76           0x0000021C  // Command response[127:96]
// Register This 32-bit register
// holds bits positions [127:96] of
// command response type R2
#define MMCHS_O_DATA            0x00000220  // Data Register This register is
// the 32-bit entry point of the
// buffer for read or write data
// transfers. The buffer size is
// 32bits x256(1024 bytes). Bytes
// within a word are stored and read
// in little endian format. This
// buffer can be used as two 512
// byte buffers to transfer data
// efficiently without reducing the
// throughput. Sequential and
// contiguous access is necessary to
// increment the pointer correctly.
// Random or skipped access is not
// allowed. In little endian if the
// local host accesses this register
// byte-wise or 16bit-wise the least
// significant byte (bits [7:0])
// must always be written/read
// first. The update of the buffer
// address is done on the most
// significant byte write for full
// 32-bit DATA register or on the
// most significant byte of the last
// word of block transfer. Example
// 1: Byte or 16-bit access
// Mbyteen[3:0]=0001 (1-byte) =>
// Mbyteen[3:0]=0010 (1-byte) =>
// Mbyteen[3:0]=1100 (2-bytes) OK
// Mbyteen[3:0]=0001 (1-byte) =>
// Mbyteen[3:0]=0010 (1-byte) =>
// Mbyteen[3:0]=0100 (1-byte) OK
// Mbyteen[3:0]=0001 (1-byte) =>
// Mbyteen[3:0]=0010 (1-byte) =>
// Mbyteen[3:0]=1000 (1-byte) Bad
#define MMCHS_O_PSTATE          0x00000224  // Present state register The Host
// can get status of the Host
// Controller from this 32-bit read
// only register.
#define MMCHS_O_HCTL            0x00000228  // Control register This register
// defines the host controls to set
// power wakeup and transfer
// parameters. MMCHS_HCTL[31:24] =
// Wakeup control MMCHS_HCTL[23:16]
// = Block gap control
// MMCHS_HCTL[15:8] = Power control
// MMCHS_HCTL[7:0] = Host control
#define MMCHS_O_SYSCTL          0x0000022C  // SD system control register This
// register defines the system
// controls to set software resets
// clock frequency management and
// data timeout. MMCHS_SYSCTL[31:24]
// = Software resets
// MMCHS_SYSCTL[23:16] = Timeout
// control MMCHS_SYSCTL[15:0] =
// Clock control
#define MMCHS_O_STAT            0x00000230  // Interrupt status register The
// interrupt status regroups all the
// status of the module internal
// events that can generate an
// interrupt. MMCHS_STAT[31:16] =
// Error Interrupt Status
// MMCHS_STAT[15:0] = Normal
// Interrupt Status
#define MMCHS_O_IE              0x00000234  // Interrupt SD enable register
// This register allows to
// enable/disable the module to set
// status bits on an event-by-event
// basis. MMCHS_IE[31:16] = Error
// Interrupt Status Enable
// MMCHS_IE[15:0] = Normal Interrupt
// Status Enable
#define MMCHS_O_ISE             0x00000238  // Interrupt signal enable register
// This register allows to
// enable/disable the module
// internal sources of status on an
// event-by-event basis.
// MMCHS_ISE[31:16] = Error
// Interrupt Signal Enable
// MMCHS_ISE[15:0] = Normal
// Interrupt Signal Enable
#define MMCHS_O_AC12            0x0000023C  // Auto CMD12 Error Status Register
// The host driver may determine
// which of the errors cases related
// to Auto CMD12 has occurred by
// checking this MMCHS_AC12 register
// when an Auto CMD12 Error
// interrupt occurs. This register
// is valid only when Auto CMD12 is
// enabled (MMCHS_CMD[ACEN]) and
// Auto CMD12Error (MMCHS_STAT[ACE])
// is set to 1. Note: These bits are
// automatically reset when starting
// a new adtc command with data.
#define MMCHS_O_CAPA            0x00000240  // Capabilities register This
// register lists the capabilities
// of the MMC/SD/SDIO host
// controller.
#define MMCHS_O_CUR_CAPA        0x00000248  // Maximum current capabilities
// Register This register indicates
// the maximum current capability
// for each voltage. The value is
// meaningful if the voltage support
// is set in the capabilities
// register (MMCHS_CAPA).
// Initialization of this register
// (via a write access to this
// register) depends on the system
// capabilities. The host driver
// shall not modify this register
// after the initilaization. This
// register is only reinitialized by
// a hard reset (via RESETN signal)
#define MMCHS_O_FE              0x00000250  // Force Event Register for Error
// Interrupt status The force Event
// Register is not a physically
// implemented register. Rather it
// is an address at which the Error
// Interrupt Status register can be
// written. The effect of a write to
// this address will be reflected in
// the Error Interrupt Status
// Register if corresponding bit of
// the Error Interrupt Status Enable
// Register is set.
#define MMCHS_O_ADMAES          0x00000254  // ADMA Error Status Register When
// ADMA Error Interrupt is occurred
// the ADMA Error States field in
// this register holds the ADMA
// state and the ADMA System Address
// Register holds the address around
// the error descriptor. For
// recovering the error the Host
// Driver requires the ADMA state to
// identify the error descriptor
// address as follows: ST_STOP:
// Previous location set in the ADMA
// System Address register is the
// error descriptor address ST_FDS:
// Current location set in the ADMA
// System Address register is the
// error descriptor address ST_CADR:
// This sate is never set because do
// not generate ADMA error in this
// state. ST_TFR: Previous location
// set in the ADMA System Address
// register is the error descriptor
// address In case of write
// operation the Host Driver should
// use ACMD22 to get the number of
// written block rather than using
// this information since unwritten
// data may exist in the Host
// Controller. The Host Controller
// generates the ADMA Error
// Interrupt when it detects invalid
// descriptor data (Valid=0) at the
// ST_FDS state. In this case ADMA
// Error State indicates that an
// error occurs at ST_FDS state. The
// Host Driver may find that the
// Valid bit is not set in the error
// descriptor.
#define MMCHS_O_ADMASAL         0x00000258  // ADMA System address Low bits
#define MMCHS_O_REV             0x000002FC  // Versions Register This register
// contains the hard coded RTL
// vendor revision number the
// version number of SD
// specification compliancy and a
// slot status bit. MMCHS_REV[31:16]
// = Host controller version
// MMCHS_REV[15:0] = Slot Interrupt
// Status

