RIOT-OS/RIOT/drivers/cc3200sdk/inc/hw_mmchs.h
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_SYSCONFIG register.
//
//******************************************************************************
#define MMCHS_SYSCONFIG_STANDBYMODE_M \
                                0x00003000  // Master interface power
// Management standby/wait control.
// The bit field is only useful when
// generic parameter MADMA_EN
// (Master ADMA enable) is set as
// active otherwise it is a read
// only register read a '0'. 0x0
// Force-standby. Mstandby is forced
// unconditionnaly. 0x1 No-standby.
// Mstandby is never asserted. 0x2
// Smart-standby mode: local
// initiator standby status depends
// on local conditions i.e. the
// module's functional requirement
// from the initiator.IP module
// shall not generate
// (initiator-related) wakeup
// events. 0x3 Smart-Standby
// wakeup-capable mode: "local
// initiator standby status depends
// on local conditions i.e. the
// module's functional requirement
// from the initiator. IP module may
// generate (master-related) wakeup
// events when in standby state.Mode
// is only relevant if the
// appropriate IP module ""mwakeup""
// output is implemented."

#define MMCHS_SYSCONFIG_STANDBYMODE_S 12
#define MMCHS_SYSCONFIG_CLOCKACTIVITY_M \
                                0x00000300  // Clocks activity during wake up
// mode period. Bit8: OCP interface
// clock Bit9: Functional clock 0x0
// OCP and Functional clock may be
// switched off. 0x1 OCP clock is
// maintained. Functional clock may
// be switched-off. 0x2 Functional
// clock is maintained. OCP clock
// may be switched-off. 0x3 OCP and
// Functional clocks are maintained.

#define MMCHS_SYSCONFIG_CLOCKACTIVITY_S 8
#define MMCHS_SYSCONFIG_SIDLEMODE_M \
                                0x00000018  // Power management 0x0 If an idle
// request is detected the MMCHS
// acknowledges it unconditionally
// and goes in Inactive mode.
// Interrupt and DMA requests are
// unconditionally de-asserted. 0x1
// If an idle request is detected
// the request is ignored and the
// module keeps on behaving
// normally. 0x2 Smart-idle mode:
// local target's idle state
// eventually follows (acknowledges)
// the system's idle requests
// depending on the IP module's
// internal requirements.IP module
// shall not generate (IRQ- or
// DMA-request-related) wakeup
// events. 0x3 Smart-idle
// wakeup-capable mode: "local
// target's idle state eventually
// follows (acknowledges) the
// system's idle requests depending
// on the IP module's internal
// requirements.IP module may
// generate (IRQ- or
// DMA-request-related) wakeup
// events when in idle state.Mode is
// only relevant if the appropriate
// IP module ""swakeup"" output(s)
// is (are) implemented."

#define MMCHS_SYSCONFIG_SIDLEMODE_S 3
#define MMCHS_SYSCONFIG_ENAWAKEUP \
                                0x00000004  // Wakeup feature control 0 Wakeup
// capability is disabled 1 Wakeup
// capability is enabled

#define MMCHS_SYSCONFIG_SOFTRESET \
                                0x00000002

#define MMCHS_SYSCONFIG_AUTOIDLE \
                                0x00000001  // Internal Clock gating strategy 0
// Clocks are free-running 1
// Automatic clock gating strategy
// is applied based on the OCP and
// MMC interface activity

//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_SYSSTATUS register.
//
//******************************************************************************
#define MMCHS_SYSSTATUS_RESETDONE \
                                0x00000001

//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_CSRE register.
//
//******************************************************************************
#define MMCHS_CSRE_CSRE_M       0xFFFFFFFF  // Card status response error
#define MMCHS_CSRE_CSRE_S       0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_SYSTEST register.
//
//******************************************************************************
#define MMCHS_SYSTEST_OBI       0x00010000
#define MMCHS_SYSTEST_SDCD      0x00008000
#define MMCHS_SYSTEST_SDWP      0x00004000
#define MMCHS_SYSTEST_WAKD      0x00002000
#define MMCHS_SYSTEST_SSB       0x00001000
#define MMCHS_SYSTEST_D7D       0x00000800
#define MMCHS_SYSTEST_D6D       0x00000400
#define MMCHS_SYSTEST_D5D       0x00000200
#define MMCHS_SYSTEST_D4D       0x00000100
#define MMCHS_SYSTEST_D3D       0x00000080
#define MMCHS_SYSTEST_D2D       0x00000040
#define MMCHS_SYSTEST_D1D       0x00000020
#define MMCHS_SYSTEST_D0D       0x00000010
#define MMCHS_SYSTEST_DDIR      0x00000008
#define MMCHS_SYSTEST_CDAT      0x00000004
#define MMCHS_SYSTEST_CDIR      0x00000002
#define MMCHS_SYSTEST_MCKD      0x00000001
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_CON register.
//
//******************************************************************************
#define MMCHS_CON_SDMA_LNE      0x00200000  // Slave DMA Level/Edge Request:
// The waveform of the DMA request
// can be configured either edge
// sensitive with early de-assertion
// on first access to MMCHS_DATA
// register or late de-assertion
// request remains active until last
// allowed data written into
// MMCHS_DATA. 0 Slave DMA edge
// sensitive Early DMA de-assertion
// 1 Slave DMA level sensitive Late
// DMA de-assertion
#define MMCHS_CON_DMA_MNS       0x00100000  // DMA Master or Slave selection:
// When this bit is set and the
// controller is configured to use
// the DMA Ocp master interface is
// used to get datas from system
// using ADMA2 procedure (direct
// access to the memory).This option
// is only available if generic
// parameter MADMA_EN is asserted to
// '1'. 0 The controller is slave on
// data transfers with system. 1 The
// controller is master on data
// exchange with system controller
// must be configured as using DMA.
#define MMCHS_CON_DDR           0x00080000  // Dual Data Rate mode: When this
// register is set the controller
// uses both clock edge to emit or
// receive data. Odd bytes are
// transmitted on falling edges and
// even bytes are transmitted on
// rise edges. It only applies on
// Data bytes and CRC Start end bits
// and CRC status are kept full
// cycle. This bit field is only
// meaningful and active for even
// clock divider ratio of
// MMCHS_SYSCTL[CLKD] it is
// insensitive to MMCHS_HCTL[HSPE]
// setting. 0 Standard mode : data
// are transmitted on a single edge
// depending on MMCHS_HCTRL[HSPE]. 1
// Data Bytes and CRC are
// transmitted on both edge.
#define MMCHS_CON_BOOT_CF0      0x00040000
#define MMCHS_CON_BOOT_ACK      0x00020000  // Book acknowledge received: When
// this bit is set the controller
// should receive a boot status on
// DAT0 line after next command
// issued. If no status is received
// a data timeout will be generated.
// 0 No acknowledge to be received 1
// A boot status will be received on
// DAT0 line after issuing a
// command.
#define MMCHS_CON_CLKEXTFREE    0x00010000  // External clock free running:
// This register is used to maintain
// card clock out of transfer
// transaction to enable slave
// module for example to generate a
// synchronous interrupt on DAT[1].
// The Clock will be maintain only
// if MMCHS_SYSCTL[CEN] is set. 0
// External card clock is cut off
// outside active transaction
// period. 1 External card clock is
// maintain even out of active
// transaction period only if
// MMCHS_SYSCTL[CEN] is set.
#define MMCHS_CON_PADEN         0x00008000  // Control Power for MMC Lines:
// This register is only useful when
// MMC PADs contain power saving
// mechanism to minimize its leakage
// power. It works as a GPIO that
// directly control the ACTIVE pin
// of PADs. Excepted for DAT[1] the
// signal is also combine outside
// the module with the dedicated
// power control MMCHS_CON[CTPL]
// bit. 0 ADPIDLE module pin is not
// forced it is automatically
// generated by the MMC fsms. 1
// ADPIDLE module pin is forced to
// active state.
#define MMCHS_CON_OBIE          0x00004000  // Out-of-Band Interrupt Enable MMC
// cards only: This bit enables the
// detection of Out-of-Band
// Interrupt on MMCOBI input pin.
// The usage of the Out-of-Band
// signal (OBI) is optional and
// depends on the system
// integration. 0 Out-of-Band
// interrupt detection disabled 1
// Out-of-Band interrupt detection
// enabled
#define MMCHS_CON_OBIP          0x00002000  // Out-of-Band Interrupt Polarity
// MMC cards only: This bit selects
// the active level of the
// out-of-band interrupt coming from
// MMC cards. The usage of the
// Out-of-Band signal (OBI) is
// optional and depends on the
// system integration. 0 active high
// level 1 active low level
#define MMCHS_CON_CEATA         0x00001000  // CE-ATA control mode MMC cards
// compliant with CE-ATA:By default
// this bit is set to 0. It is use
// to indicate that next commands
// are considered as specific CE-ATA
// commands that potentially use
// 'command completion' features. 0
// Standard MMC/SD/SDIO mode. 1
// CE-ATA mode next commands are
// considered as CE-ATA commands.
#define MMCHS_CON_CTPL          0x00000800  // Control Power for DAT[1] line
// MMC and SD cards: By default this
// bit is set to 0 and the host
// controller automatically disables
// all the input buffers outside of
// a transaction to minimize the
// leakage current. SDIO cards: When
// this bit is set to 1 the host
// controller automatically disables
// all the input buffers except the
// buffer of DAT[1] outside of a
// transaction in order to detect
// asynchronous card interrupt on
// DAT[1] line and minimize the
// leakage current of the buffers. 0
// Disable all the input buffers
// outside of a transaction. 1
// Disable all the input buffers
// except the buffer of DAT[1]
// outside of a transaction.
#define MMCHS_CON_DVAL_M        0x00000600  // Debounce filter value All cards
// This register is used to define a
// debounce period to filter the
// card detect input signal (SDCD).
// The usage of the card detect
// input signal (SDCD) is optional
// and depends on the system
// integration and the type of the
// connector housing that
// accommodates the card. 0x0 33 us
// debounce period 0x1 231 us
// debounce period 0x2 1 ms debounce
// period 0x3 84 ms debounce period
#define MMCHS_CON_DVAL_S        9
#define MMCHS_CON_WPP           0x00000100  // Write protect polarity For SD
// and SDIO cards only This bit
// selects the active level of the
// write protect input signal
// (SDWP). The usage of the write
// protect input signal (SDWP) is
// optional and depends on the
// system integration and the type
// of the connector housing that
// accommodates the card. 0 active
// high level 1 active low level
#define MMCHS_CON_CDP           0x00000080  // Card detect polarity All cards
// This bit selects the active level
// of the card detect input signal
// (SDCD). The usage of the card
// detect input signal (SDCD) is
// optional and depends on the
// system integration and the type
// of the connector housing that
// accommodates the card. 0 active
// high level 1 active low level
#define MMCHS_CON_MIT           0x00000040  // MMC interrupt command Only for
// MMC cards. This bit must be set
// to 1 when the next write access
// to the command register
// (MMCHS_CMD) is for writing a MMC
// interrupt command (CMD40)
// requiring the command timeout
// detection to be disabled for the
// command response. 0 Command
// timeout enabled 1 Command timeout
// disabled
#define MMCHS_CON_DW8           0x00000020  // 8-bit mode MMC select For
// SD/SDIO cards this bit must be
// set to 0. For MMC card this bit
// must be set following a valid
// SWITCH command (CMD6) with the
// correct value and extend CSD
// index written in the argument.
// Prior to this command the MMC
// card configuration register (CSD
// and EXT_CSD) must be verified for
// compliancy with MMC standard
// specification 4.x (see section
// 3.6). 0 1-bit or 4-bit Data width
// (DAT[0] used MMC SD cards) 1
// 8-bit Data width (DAT[7:0] used
// MMC cards)
#define MMCHS_CON_MODE          0x00000010  // Mode select All cards These bits
// select between Functional mode
// and SYSTEST mode. 0 Functional
// mode. Transfers to the
// MMC/SD/SDIO cards follow the card
// protocol. MMC clock is enabled.
// MMC/SD transfers are operated
// under the control of the CMD
// register. 1 SYSTEST mode The
// signal pins are configured as
// general-purpose input/output and
// the 1024-byte buffer is
// configured as a stack memory
// accessible only by the local host
// or system DMA. The pins retain
// their default type (input output
// or in-out). SYSTEST mode is
// operated under the control of the
// SYSTEST register.
#define MMCHS_CON_STR           0x00000008  // Stream command Only for MMC
// cards. This bit must be set to 1
// only for the stream data
// transfers (read or write) of the
// adtc commands. Stream read is a
// class 1 command (CMD11:
// READ_DAT_UNTIL_STOP). Stream
// write is a class 3 command
// (CMD20: WRITE_DAT_UNTIL_STOP). 0
// Block oriented data transfer 1
// Stream oriented data transfer
#define MMCHS_CON_HR            0x00000004  // Broadcast host response Only for
// MMC cards. This register is used
// to force the host to generate a
// 48-bit response for bc command
// type. "It can be used to
// terminate the interrupt mode by
// generating a CMD40 response by
// the core (see section 4.3
// ""Interrupt Mode"" in the MMC [1]
// specification). In order to have
// the host response to be generated
// in open drain mode the register
// MMCHS_CON[OD] must be set to 1."
// When MMCHS_CON[CEATA] is set to 1
// and MMCHS_ARG set to 0x00000000
// when writing 0x00000000 into
// MMCHS_CMD register the host
// controller performs a 'command
// completion signal disable' token
// i.e. CMD line held to '0' during
// 47 cycles followed by a 1. 0 The
// host does not generate a 48-bit
// response instead of a command. 1
// The host generates a 48-bit
// response instead of a command or
// a command completion signal
// disable token.
#define MMCHS_CON_INIT          0x00000002  // Send initialization stream All
// cards. When this bit is set to 1
// and the card is idle an
// initialization sequence is sent
// to the card. "An initialization
// sequence consists of setting the
// CMD line to 1 during 80 clock
// cycles. The initialisation
// sequence is mandatory - but it is
// not required to do it through
// this bit - this bit makes it
// easier. Clock divider
// (MMCHS_SYSCTL[CLKD]) should be
// set to ensure that 80 clock
// periods are greater than 1ms.
// (see section 9.3 ""Power-Up"" in
// the MMC card specification [1] or
// section 6.4 in the SD card
// specification [2])." Note: in
// this mode there is no command
// sent to the card and no response
// is expected 0 The host does not
// send an initialization sequence.
// 1 The host sends an
// initialization sequence.
#define MMCHS_CON_OD            0x00000001  // Card open drain mode. Only for
// MMC cards. This bit must be set
// to 1 for MMC card commands 1 2 3
// and 40 and if the MMC card bus is
// operating in open-drain mode
// during the response phase to the
// command sent. Typically during
// card identification mode when the
// card is either in idle ready or
// ident state. It is also necessary
// to set this bit to 1 for a
// broadcast host response (see
// Broadcast host response register
// MMCHS_CON[HR]) 0 No Open Drain 1
// Open Drain or Broadcast host
// response
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_PWCNT register.
//
//******************************************************************************
#define MMCHS_PWCNT_PWRCNT_M    0x0000FFFF  // Power counter register. This
// register is used to introduce a
// delay between the PAD ACTIVE pin
// assertion and the command issued.
// 0x0000 No additional delay added
// 0x0001 TCF delay (card clock
// period) 0x0002 TCF x 2 delay
// (card clock period) 0xFFFE TCF x
// 65534 delay (card clock period)
// 0xFFFF TCF x 65535 delay (card
// clock period)
#define MMCHS_PWCNT_PWRCNT_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_BLK register.
//
//******************************************************************************
#define MMCHS_BLK_NBLK_M        0xFFFF0000  // Blocks count for current
// transfer This register is enabled
// when Block count Enable
// (MMCHS_CMD[BCE]) is set to 1 and
// is valid only for multiple block
// transfers. Setting the block
// count to 0 results no data blocks
// being transferred. Note: The host
// controller decrements the block
// count after each block transfer
// and stops when the count reaches
// zero. This register can be
// accessed only if no transaction
// is executing (i.e after a
// transaction has stopped). Read
// operations during transfers may
// return an invalid value and write
// operation will be ignored. In
// suspend context the number of
// blocks yet to be transferred can
// be determined by reading this
// register. When restoring transfer
// context prior to issuing a Resume
// command The local host shall
// restore the previously saved
// block count. 0x0000 Stop count
// 0x0001 1 block 0x0002 2 blocks
// 0xFFFF 65535 blocks
#define MMCHS_BLK_NBLK_S        16
#define MMCHS_BLK_BLEN_M        0x00000FFF  // Transfer Block Size. This
// register specifies the block size
// for block data transfers. Read
// operations during transfers may
// return an invalid value and write
// operations are ignored. When a
// CMD12 command is issued to stop
// the transfer a read of the BLEN
// field after transfer completion
// (MMCHS_STAT[TC] set to 1) will
// not return the true byte number
// of data length while the stop
// occurs but the value written in
// this register before transfer is
// launched. 0x000 No data transfer
// 0x001 1 byte block length 0x002 2
// bytes block length 0x003 3 bytes
// block length 0x1FF 511 bytes
// block length 0x200 512 bytes
// block length 0x7FF 2047 bytes
// block length 0x800 2048 bytes
// block length
#define MMCHS_BLK_BLEN_S        0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_ARG register.
//
//******************************************************************************
#define MMCHS_ARG_ARG_M         0xFFFFFFFF  // Command argument bits [31:0]
#define MMCHS_ARG_ARG_S         0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_CMD register.
//
//******************************************************************************
#define MMCHS_CMD_INDX_M        0x3F000000  // Command index Binary encoded
// value from 0 to 63 specifying the
// command number send to card 0x00
// CMD0 or ACMD0 0x01 CMD1 or ACMD1
// 0x02 CMD2 or ACMD2 0x03 CMD3 or
// ACMD3 0x04 CMD4 or ACMD4 0x05
// CMD5 or ACMD5 0x06 CMD6 or ACMD6
// 0x07 CMD7 or ACMD7 0x08 CMD8 or
// ACMD8 0x09 CMD9 or ACMD9 0x0A
// CMD10 or ACMD10 0x0B CMD11 or
// ACMD11 0x0C CMD12 or ACMD12 0x0D
// CMD13 or ACMD13 0x0E CMD14 or
// ACMD14 0x0F CMD15 or ACMD15 0x10
// CMD16 or ACMD16 0x11 CMD17 or
// ACMD17 0x12 CMD18 or ACMD18 0x13
// CMD19 or ACMD19 0x14 CMD20 or
// ACMD20 0x15 CMD21 or ACMD21 0x16
// CMD22 or ACMD22 0x17 CMD23 or
// ACMD23 0x18 CMD24 or ACMD24 0x19
// CMD25 or ACMD25 0x1A CMD26 or
// ACMD26 0x1B CMD27 or ACMD27 0x1C
// CMD28 or ACMD28 0x1D CMD29 or
// ACMD29 0x1E CMD30 or ACMD30 0x1F
// CMD31 or ACMD31 0x20 CMD32 or
// ACMD32 0x21 CMD33 or ACMD33 0x22
// CMD34 or ACMD34 0x23 CMD35 or
// ACMD35 0x24 CMD36 or ACMD36 0x25
// CMD37 or ACMD37 0x26 CMD38 or
// ACMD38 0x27 CMD39 or ACMD39 0x28
// CMD40 or ACMD40 0x29 CMD41 or
// ACMD41 0x2A CMD42 or ACMD42 0x2B
// CMD43 or ACMD43 0x2C CMD44 or
// ACMD44 0x2D CMD45 or ACMD45 0x2E
// CMD46 or ACMD46 0x2F CMD47 or
// ACMD47 0x30 CMD48 or ACMD48 0x31
// CMD49 or ACMD49 0x32 CMD50 or
// ACMD50 0x33 CMD51 or ACMD51 0x34
// CMD52 or ACMD52 0x35 CMD53 or
// ACMD53 0x36 CMD54 or ACMD54 0x37
// CMD55 or ACMD55 0x38 CMD56 or
// ACMD56 0x39 CMD57 or ACMD57 0x3A
// CMD58 or ACMD58 0x3B CMD59 or
// ACMD59 0x3C CMD60 or ACMD60 0x3D
// CMD61 or ACMD61 0x3E CMD62 or
// ACMD62 0x3F CMD63 or ACMD63
#define MMCHS_CMD_INDX_S        24
#define MMCHS_CMD_CMD_TYPE_M    0x00C00000  // Command type This register
// specifies three types of special
// command: Suspend Resume and
// Abort. These bits shall be set to
// 00b for all other commands. 0x0
// Others Commands 0x1 "CMD52 for
// writing ""Bus Suspend"" in CCCR"
// 0x2 "CMD52 for writing ""Function
// Select"" in CCCR" 0x3 "Abort
// command CMD12 CMD52 for writing
// "" I/O Abort"" in CCCR"
#define MMCHS_CMD_CMD_TYPE_S    22
#define MMCHS_CMD_DP            0x00200000  // Data present select This
// register indicates that data is
// present and DAT line shall be
// used. It must be set to 0 in the
// following conditions: - command
// using only CMD line - command
// with no data transfer but using
// busy signal on DAT[0] - Resume
// command 0 Command with no data
// transfer 1 Command with data
// transfer
#define MMCHS_CMD_CICE          0x00100000  // Command Index check enable This
// bit must be set to 1 to enable
// index check on command response
// to compare the index field in the
// response against the index of the
// command. If the index is not the
// same in the response as in the
// command it is reported as a
// command index error
// (MMCHS_STAT[CIE] set to1) Note:
// The register CICE cannot be
// configured for an Auto CMD12 then
// index check is automatically
// checked when this command is
// issued. 0 Index check disable 1
// Index check enable
#define MMCHS_CMD_CCCE          0x00080000  // Command CRC check enable This
// bit must be set to 1 to enable
// CRC7 check on command response to
// protect the response against
// transmission errors on the bus.
// If an error is detected it is
// reported as a command CRC error
// (MMCHS_STAT[CCRC] set to 1).
// Note: The register CCCE cannot be
// configured for an Auto CMD12 and
// then CRC check is automatically
// checked when this command is
// issued. 0 CRC7 check disable 1
// CRC7 check enable
#define MMCHS_CMD_RSP_TYPE_M    0x00030000  // Response type This bits defines
// the response type of the command
// 0x0 No response 0x1 Response
// Length 136 bits 0x2 Response
// Length 48 bits 0x3 Response
// Length 48 bits with busy after
// response
#define MMCHS_CMD_RSP_TYPE_S    16
#define MMCHS_CMD_MSBS          0x00000020  // Multi/Single block select This
// bit must be set to 1 for data
// transfer in case of multi block
// command. For any others command
// this bit shall be set to 0. 0
// Single block. If this bit is 0 it
// is not necessary to set the
// register MMCHS_BLK[NBLK]. 1 Multi
// block. When Block Count is
// disabled (MMCHS_CMD[BCE] is set
// to 0) in Multiple block transfers
// (MMCHS_CMD[MSBS] is set to 1) the
// module can perform infinite
// transfer.
#define MMCHS_CMD_DDIR          0x00000010  // Data transfer Direction Select
// This bit defines either data
// transfer will be a read or a
// write. 0 Data Write (host to
// card) 1 Data Read (card to host)
#define MMCHS_CMD_ACEN          0x00000004  // Auto CMD12 Enable SD card only.
// When this bit is set to 1 the
// host controller issues a CMD12
