RIOT-OS/RIOT/drivers/cc3200sdk/inc/hw_mmchs.h
// automatically after the transfer
// completion of the last block. The
// Host Driver shall not set this
// bit to issue commands that do not
// require CMD12 to stop data
// transfer. In particular secure
// commands do not require CMD12. 0
// Auto CMD12 disable 1 Auto CMD12
// enable or CCS detection enabled.
#define MMCHS_CMD_BCE           0x00000002  // Block Count Enable Multiple
// block transfers only. This bit is
// used to enable the block count
// register (MMCHS_BLK[NBLK]). When
// Block Count is disabled
// (MMCHS_CMD[BCE] is set to 0) in
// Multiple block transfers
// (MMCHS_CMD[MSBS] is set to 1) the
// module can perform infinite
// transfer. 0 Block count disabled
// for infinite transfer. 1 Block
// count enabled for multiple block
// transfer with known number of
// blocks
#define MMCHS_CMD_DE            0x00000001  // DMA Enable This bit is used to
// enable DMA mode for host data
// access. 0 DMA mode disable 1 DMA
// mode enable
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_RSP10 register.
//
//******************************************************************************
#define MMCHS_RSP10_RSP1_M      0xFFFF0000  // Command Response [31:16]
#define MMCHS_RSP10_RSP1_S      16
#define MMCHS_RSP10_RSP0_M      0x0000FFFF  // Command Response [15:0]
#define MMCHS_RSP10_RSP0_S      0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_RSP32 register.
//
//******************************************************************************
#define MMCHS_RSP32_RSP3_M      0xFFFF0000  // Command Response [63:48]
#define MMCHS_RSP32_RSP3_S      16
#define MMCHS_RSP32_RSP2_M      0x0000FFFF  // Command Response [47:32]
#define MMCHS_RSP32_RSP2_S      0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_RSP54 register.
//
//******************************************************************************
#define MMCHS_RSP54_RSP5_M      0xFFFF0000  // Command Response [95:80]
#define MMCHS_RSP54_RSP5_S      16
#define MMCHS_RSP54_RSP4_M      0x0000FFFF  // Command Response [79:64]
#define MMCHS_RSP54_RSP4_S      0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_RSP76 register.
//
//******************************************************************************
#define MMCHS_RSP76_RSP7_M      0xFFFF0000  // Command Response [127:112]
#define MMCHS_RSP76_RSP7_S      16
#define MMCHS_RSP76_RSP6_M      0x0000FFFF  // Command Response [111:96]
#define MMCHS_RSP76_RSP6_S      0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_DATA register.
//
//******************************************************************************
#define MMCHS_DATA_DATA_M       0xFFFFFFFF  // Data Register [31:0] In
// functional mode (MMCHS_CON[MODE]
// set to the default value 0) A
// read access to this register is
// allowed only when the buffer read
// enable status is set to 1
// (MMCHS_PSTATE[BRE]) otherwise a
// bad access (MMCHS_STAT[BADA]) is
// signaled. A write access to this
// register is allowed only when the
// buffer write enable status is set
// to 1(MMCHS_STATE[BWE]) otherwise
// a bad access (MMCHS_STAT[BADA])
// is signaled and the data is not
// written.
#define MMCHS_DATA_DATA_S       0
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_PSTATE register.
//
//******************************************************************************
#define MMCHS_PSTATE_CLEV       0x01000000
#define MMCHS_PSTATE_DLEV_M     0x00F00000  // DAT[3:0] line signal level
// DAT[3] => bit 23 DAT[2] => bit 22
// DAT[1] => bit 21 DAT[0] => bit 20
// This status is used to check DAT
// line level to recover from errors
// and for debugging. This is
// especially useful in detecting
// the busy signal level from
// DAT[0]. The value of these
// registers after reset depends on
// the DAT lines level at that time.
#define MMCHS_PSTATE_DLEV_S     20
#define MMCHS_PSTATE_WP         0x00080000
#define MMCHS_PSTATE_CDPL       0x00040000
#define MMCHS_PSTATE_CSS        0x00020000
#define MMCHS_PSTATE_CINS       0x00010000
#define MMCHS_PSTATE_BRE        0x00000800
#define MMCHS_PSTATE_BWE        0x00000400
#define MMCHS_PSTATE_RTA        0x00000200
#define MMCHS_PSTATE_WTA        0x00000100
#define MMCHS_PSTATE_DLA        0x00000004
#define MMCHS_PSTATE_DATI       0x00000002
#define MMCHS_PSTATE_CMDI       0x00000001
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_HCTL register.
//
//******************************************************************************
#define MMCHS_HCTL_OBWE         0x08000000  // Wakeup event enable for
// 'Out-of-Band' Interrupt. This bit
// enables wakeup events for
// 'Out-of-Band' assertion. Wakeup
// is generated if the wakeup
// feature is enabled
// (MMCHS_SYSCONFIG[ENAWAKEUP]). The
// write to this register is ignored
// when MMCHS_CON[OBIE] is not set.
// 0 Disable wakeup on 'Out-of-Band'
// Interrupt 1 Enable wakeup on
// 'Out-of-Band' Interrupt
#define MMCHS_HCTL_REM          0x04000000  // Wakeup event enable on SD card
// removal This bit enables wakeup
// events for card removal
// assertion. Wakeup is generated if
// the wakeup feature is enabled
// (MMCHS_SYSCONFIG[ENAWAKEUP]). 0
// Disable wakeup on card removal 1
// Enable wakeup on card removal
#define MMCHS_HCTL_INS          0x02000000  // Wakeup event enable on SD card
// insertion This bit enables wakeup
// events for card insertion
// assertion. Wakeup is generated if
// the wakeup feature is enabled
// (MMCHS_SYSCONFIG[ENAWAKEUP]). 0
// Disable wakeup on card insertion
// 1 Enable wakeup on card insertion
#define MMCHS_HCTL_IWE          0x01000000  // Wakeup event enable on SD card
// interrupt This bit enables wakeup
// events for card interrupt
// assertion. Wakeup is generated if
// the wakeup feature is enabled
// (MMCHS_SYSCONFIG[ENAWAKEUP]). 0
// Disable wakeup on card interrupt
// 1 Enable wakeup on card interrupt
#define MMCHS_HCTL_IBG          0x00080000  // Interrupt block at gap This bit
// is valid only in 4-bit mode of
// SDIO card to enable interrupt
// detection in the interrupt cycle
// at block gap for a multiple block
// transfer. For MMC cards and for
// SD card this bit should be set to
// 0. 0 Disable interrupt detection
// at the block gap in 4-bit mode 1
// Enable interrupt detection at the
// block gap in 4-bit mode
#define MMCHS_HCTL_RWC          0x00040000  // Read wait control The read wait
// function is optional only for
// SDIO cards. If the card supports
// read wait this bit must be
// enabled then requesting a stop at
// block gap (MMCHS_HCTL[SBGR])
// generates a read wait period
// after the current end of block.
// Be careful if read wait is not
// supported it may cause a conflict
// on DAT line. 0 Disable Read Wait
// Control. Suspend/Resume cannot be
// supported. 1 Enable Read Wait
// Control
#define MMCHS_HCTL_CR           0x00020000  // Continue request This bit is
// used to restart a transaction
// that was stopped by requesting a
// stop at block gap
// (MMCHS_HCTL[SBGR]). Set this bit
// to 1 restarts the transfer. The
// bit is automatically set to 0 by
// the host controller when transfer
// has restarted i.e DAT line is
// active (MMCHS_PSTATE[DLA]) or
// transferring data
// (MMCHS_PSTATE[WTA]). The Stop at
// block gap request must be
// disabled (MMCHS_HCTL[SBGR]=0)
// before setting this bit. 0 No
// affect 1 transfer restart
#define MMCHS_HCTL_SBGR         0x00010000  // Stop at block gap request This
// bit is used to stop executing a
// transaction at the next block
// gap. The transfer can restart
// with a continue request
// (MMHS_HCTL[CR]) or during a
// suspend/resume sequence. In case
// of read transfer the card must
// support read wait control. In
// case of write transfer the host
// driver shall set this bit after
// all block data written. Until the
// transfer completion
// (MMCHS_STAT[TC] set to 1) the
// host driver shall leave this bit
// set to 1. If this bit is set the
// local host shall not write to the
// data register (MMCHS_DATA). 0
// Transfer mode 1 Stop at block gap
#define MMCHS_HCTL_SDVS_M       0x00000E00  // SD bus voltage select All cards.
// The host driver should set to
// these bits to select the voltage
// level for the card according to
// the voltage supported by the
// system (MMCHS_CAPA[VS18VS30VS33])
// before starting a transfer. 0x5
// 1.8V (Typical) 0x6 3.0V (Typical)
// 0x7 3.3V (Typical)
#define MMCHS_HCTL_SDVS_S       9
#define MMCHS_HCTL_SDBP         0x00000100  // SD bus power Before setting this
// bit the host driver shall select
// the SD bus voltage
// (MMCHS_HCTL[SDVS]). If the host
// controller detects the No card
// state this bit is automatically
// set to 0. If the module is power
// off a write in the command
// register (MMCHS_CMD) will not
// start the transfer. A write to
// this bit has no effect if the
// selected SD bus voltage
// MMCHS_HCTL[SDVS] is not supported
// according to capability register
// (MMCHS_CAPA[VS*]). 0 Power off 1
// Power on
#define MMCHS_HCTL_CDSS         0x00000080  // Card Detect Signal Selection
// This bit selects source for the
// card detection.When the source
// for the card detection is
// switched the interrupt should be
// disabled during the switching
// period by clearing the Interrupt
// Status/Signal Enable register in
// order to mask unexpected
// interrupt being caused by the
// glitch. The Interrupt
// Status/Signal Enable should be
// disabled during over the period
// of debouncing. 0 SDCD# is
// selected (for normal use) 1 The
// Card Detect Test Level is
// selected (for test purpose)
#define MMCHS_HCTL_CDTL         0x00000040  // Card Detect Test Level: This bit
// is enabled while the Card Detect
// Signal Selection is set to 1 and
// it indicates card inserted or
// not. 0 No Card 1 Card Inserted
#define MMCHS_HCTL_DMAS_M       0x00000018  // DMA Select Mode: One of
// supported DMA modes can be
// selected. The host driver shall
// check support of DMA modes by
// referring the Capabilities
// register. Use of selected DMA is
// determined by DMA Enable of the
// Transfer Mode register. This
// register is only meaningful when
// MADMA_EN is set to 1. When
// MADMA_EN is set to 0 the bit
// field is read only and returned
// value is 0. 0x0 Reserved 0x1
// Reserved 0x2 32-bit Address ADMA2
// is selected 0x3 Reserved
#define MMCHS_HCTL_DMAS_S       3
#define MMCHS_HCTL_HSPE         0x00000004  // High Speed Enable: Before
// setting this bit the Host Driver
// shall check the High Speed
// Support in the Capabilities
// register. If this bit is set to 0
// (default) the Host Controller
// outputs CMD line and DAT lines at
// the falling edge of the SD Clock.
// If this bit is set to 1 the Host
// Controller outputs CMD line and
// DAT lines at the rising edge of
// the SD Clock.This bit shall not
// be set when dual data rate mode
// is activated in MMCHS_CON[DDR]. 0
// Normal speed mode 1 High speed
// mode
#define MMCHS_HCTL_DTW          0x00000002  // Data transfer width For MMC card
// this bit must be set following a
// valid SWITCH command (CMD6) with
// the correct value and extend CSD
// index written in the argument.
// Prior to this command the MMC
// card configuration register (CSD
// and EXT_CSD) must be verified for
// compliance with MMC standard
// specification 4.x (see section
// 3.6). This register has no effect
// when the MMC 8-bit mode is
// selected (register MMCHS_CON[DW8]
// set to1 ) For SD/SDIO cards this
// bit must be set following a valid
// SET_BUS_WIDTH command (ACMD6)
// with the value written in bit 1
// of the argument. Prior to this
// command the SD card configuration
// register (SCR) must be verified
// for the supported bus width by
// the SD card. 0 1-bit Data width
// (DAT[0] used) 1 4-bit Data width
// (DAT[3:0] used)
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_SYSCTL register.
//
//******************************************************************************
#define MMCHS_SYSCTL_SRD        0x04000000  // Software reset for DAT line This
// bit is set to 1 for reset and
// released to 0 when completed. DAT
// finite state machine in both
// clock domain are also reset. Here
// below are the registers cleared
// by MMCHS_SYSCTL[SRD]: #VALUE! -
// MMCHS_PSTATE: BRE BWE RTA WTA DLA
// and DATI - MMCHS_HCTL: SBGR and
// CR - MMCHS_STAT: BRR BWR BGE and
// TC OCP and MMC buffer data
// management is reinitialized. 0
// Reset completed 1 Software reset
// for DAT line
#define MMCHS_SYSCTL_SRC        0x02000000  // Software reset for CMD line This
// bit is set to 1 for reset and
// released to 0 when completed. CMD
// finite state machine in both
// clock domain are also reset. Here
// below the registers cleared by
// MMCHS_SYSCTL[SRC]: -
// MMCHS_PSTATE: CMDI - MMCHS_STAT:
// CC OCP and MMC command status
// management is reinitialized. 0
// Reset completed 1 Software reset
// for CMD line
#define MMCHS_SYSCTL_SRA        0x01000000  // Software reset for all This bit
// is set to 1 for reset and
// released to 0 when completed.
// This reset affects the entire
// host controller except for the
// card detection circuit and
// capabilities registers. 0 Reset
// completed 1 Software reset for
// all the design
#define MMCHS_SYSCTL_DTO_M      0x000F0000  // Data timeout counter value and
// busy timeout. This value
// determines the interval by which
// DAT lines timeouts are detected.
// The host driver needs to set this
// bitfield based on - the maximum
// read access time (NAC) (Refer to
// the SD Specification Part1
// Physical Layer) - the data read
// access time values (TAAC and
// NSAC) in the card specific data
// register (CSD) of the card - the
// timeout clock base frequency
// (MMCHS_CAPA[TCF]). If the card
// does not respond within the
// specified number of cycles a data
// timeout error occurs
// (MMCHS_STA[DTO]). The
// MMCHS_SYSCTL[DTO] register is
// also used to check busy duration
// to generate busy timeout for
// commands with busy response or
// for busy programming during a
// write command. Timeout on CRC
// status is generated if no CRC
// token is present after a block
// write. 0x0 TCF x 2^13 0x1 TCF x
// 2^14 0xE TCF x 2^27 0xF Reserved
#define MMCHS_SYSCTL_DTO_S      16
#define MMCHS_SYSCTL_CLKD_M     0x0000FFC0  // Clock frequency select These
// bits define the ratio between a
// reference clock frequency (system
// dependant) and the output clock
// frequency on the CLK pin of
// either the memory card (MMC SD or
// SDIO). 0x000 Clock Ref bypass
// 0x001 Clock Ref bypass 0x002
// Clock Ref / 2 0x003 Clock Ref / 3
// 0x3FF Clock Ref / 1023
#define MMCHS_SYSCTL_CLKD_S     6
#define MMCHS_SYSCTL_CEN        0x00000004  // Clock enable This bit controls
// if the clock is provided to the
// card or not. 0 The clock is not
// provided to the card . Clock
// frequency can be changed . 1 The
// clock is provided to the card and
// can be automatically gated when
// MMCHS_SYSCONFIG[AUTOIDLE] is set
// to 1 (default value) . The host
// driver shall wait to set this bit
// to 1 until the Internal clock is
// stable (MMCHS_SYSCTL[ICS]).
#define MMCHS_SYSCTL_ICS        0x00000002
#define MMCHS_SYSCTL_ICE        0x00000001  // Internal clock enable This
// register controls the internal
// clock activity. In very low power
// state the internal clock is
// stopped. Note: The activity of
// the debounce clock (used for
// wakeup events) and the OCP clock
// (used for reads and writes to the
// module register map) are not
// affected by this register. 0 The
// internal clock is stopped (very
// low power state). 1 The internal
// clock oscillates and can be
// automatically gated when
// MMCHS_SYSCONFIG[AUTOIDLE] is set
// to 1 (default value) .
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_STAT register.
//
//******************************************************************************
#define MMCHS_STAT_BADA         0x20000000
#define MMCHS_STAT_CERR         0x10000000
#define MMCHS_STAT_ADMAE        0x02000000
#define MMCHS_STAT_ACE          0x01000000
#define MMCHS_STAT_DEB          0x00400000
#define MMCHS_STAT_DCRC         0x00200000
#define MMCHS_STAT_DTO          0x00100000
#define MMCHS_STAT_CIE          0x00080000
#define MMCHS_STAT_CEB          0x00040000
#define MMCHS_STAT_CCRC         0x00020000
#define MMCHS_STAT_CTO          0x00010000
#define MMCHS_STAT_ERRI         0x00008000
#define MMCHS_STAT_BSR          0x00000400
#define MMCHS_STAT_OBI          0x00000200
#define MMCHS_STAT_CIRQ         0x00000100
#define MMCHS_STAT_CREM         0x00000080
#define MMCHS_STAT_CINS         0x00000040
#define MMCHS_STAT_BRR          0x00000020
#define MMCHS_STAT_BWR          0x00000010
#define MMCHS_STAT_DMA          0x00000008
#define MMCHS_STAT_BGE          0x00000004
#define MMCHS_STAT_TC           0x00000002
#define MMCHS_STAT_CC           0x00000001
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_IE register.
//
//******************************************************************************
#define MMCHS_IE_BADA_ENABLE    0x20000000  // Bad access to data space
// Interrupt Enable 0 Masked 1
// Enabled
#define MMCHS_IE_CERR_ENABLE    0x10000000  // Card error interrupt Enable 0
// Masked 1 Enabled
#define MMCHS_IE_ADMAE_ENABLE   0x02000000  // ADMA error Interrupt Enable 0
// Masked 1 Enabled
#define MMCHS_IE_ACE_ENABLE     0x01000000  // Auto CMD12 error Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_DEB_ENABLE     0x00400000  // Data end bit error Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_DCRC_ENABLE    0x00200000  // Data CRC error Interrupt Enable
// 0 Masked 1 Enabled
#define MMCHS_IE_DTO_ENABLE     0x00100000  // Data timeout error Interrupt
// Enable 0 The data timeout
// detection is deactivated. The
// host controller provides the
// clock to the card until the card
// sends the data or the transfer is
// aborted. 1 The data timeout
// detection is enabled.
#define MMCHS_IE_CIE_ENABLE     0x00080000  // Command index error Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_CEB_ENABLE     0x00040000  // Command end bit error Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_CCRC_ENABLE    0x00020000  // Command CRC error Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_CTO_ENABLE     0x00010000  // Command timeout error Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_NULL           0x00008000  // Fixed to 0 The host driver shall
// control error interrupts using
// the Error Interrupt Signal Enable
// register. Writes to this bit are
// ignored
#define MMCHS_IE_BSR_ENABLE     0x00000400  // Boot status interrupt Enable A
// write to this register when
// MMCHS_CON[BOOT_ACK] is set to 0x0
// is ignored. 0 Masked 1 Enabled
#define MMCHS_IE_OBI_ENABLE     0x00000200  // Out-of-Band interrupt Enable A
// write to this register when
// MMCHS_CON[OBIE] is set to '0' is
// ignored. 0 Masked 1 Enabled
#define MMCHS_IE_CIRQ_ENABLE    0x00000100  // Card interrupt Enable A clear of
// this bit also clears the
// corresponding status bit. During
// 1-bit mode if the interrupt
// routine doesn't remove the source
// of a card interrupt in the SDIO
// card the status bit is reasserted
// when this bit is set to 1. 0
// Masked 1 Enabled
#define MMCHS_IE_CREM_ENABLE    0x00000080  // Card removal Interrupt Enable 0
// Masked 1 Enabled
#define MMCHS_IE_CINS_ENABLE    0x00000040  // Card insertion Interrupt Enable
// 0 Masked 1 Enabled
#define MMCHS_IE_BRR_ENABLE     0x00000020  // Buffer Read Ready Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_BWR_ENABLE     0x00000010  // Buffer Write Ready Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_DMA_ENABLE     0x00000008  // DMA interrupt Enable 0 Masked 1
// Enabled
#define MMCHS_IE_BGE_ENABLE     0x00000004  // Block Gap Event Interrupt Enable
// 0 Masked 1 Enabled
#define MMCHS_IE_TC_ENABLE      0x00000002  // Transfer completed Interrupt
// Enable 0 Masked 1 Enabled
#define MMCHS_IE_CC_ENABLE      0x00000001  // Command completed Interrupt
// Enable 0 Masked 1 Enabled
//******************************************************************************
//
// The following are defines for the bit fields in the MMCHS_O_ISE register.
//
//******************************************************************************
#define MMCHS_ISE_BADA_SIGEN    0x20000000  // Bad access to data space signal
// status Enable 0 Masked 1 Enabled
#define MMCHS_ISE_CERR_SIGEN    0x10000000  // Card error interrupt signal
// status Enable 0 Masked 1 Enabled
#define MMCHS_ISE_ADMAE_SIGEN   0x02000000  // ADMA error signal status Enable
// 0 Masked 1 Enabled
#define MMCHS_ISE_ACE_SIGEN     0x01000000  // Auto CMD12 error signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_DEB_SIGEN     0x00400000  // Data end bit error signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_DCRC_SIGEN    0x00200000  // Data CRC error signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_DTO_SIGEN     0x00100000  // Data timeout error signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_CIE_SIGEN     0x00080000  // Command index error signal
// status Enable 0 Masked 1 Enabled
#define MMCHS_ISE_CEB_SIGEN     0x00040000  // Command end bit error signal
// status Enable 0 Masked 1 Enabled
#define MMCHS_ISE_CCRC_SIGEN    0x00020000  // Command CRC error signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_CTO_SIGEN     0x00010000  // Command timeout error signal
// status Enable 0 Masked 1 Enabled
#define MMCHS_ISE_NULL          0x00008000  // Fixed to 0 The host driver shall
// control error interrupts using
// the Error Interrupt Signal Enable
// register. Writes to this bit are
// ignored
#define MMCHS_ISE_BSR_SIGEN     0x00000400  // Boot status signal status
// EnableA write to this register
// when MMCHS_CON[BOOT_ACK] is set
// to 0x0 is ignored. 0 Masked 1
// Enabled
#define MMCHS_ISE_OBI_SIGEN     0x00000200  // Out-Of-Band Interrupt signal
// status Enable A write to this
// register when MMCHS_CON[OBIE] is
// set to '0' is ignored. 0 Masked 1
// Enabled
#define MMCHS_ISE_CIRQ_SIGEN    0x00000100  // Card interrupt signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_CREM_SIGEN    0x00000080  // Card removal signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_CINS_SIGEN    0x00000040  // Card insertion signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_BRR_SIGEN     0x00000020  // Buffer Read Ready signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_BWR_SIGEN     0x00000010  // Buffer Write Ready signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_DMA_SIGEN     0x00000008  // DMA interrupt Signal status
// enable 0 Masked 1 Enabled
#define MMCHS_ISE_BGE_SIGEN     0x00000004  // Black Gap Event signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_TC_SIGEN      0x00000002  // Transfer completed signal status
// Enable 0 Masked 1 Enabled
#define MMCHS_ISE_CC_SIGEN      0x00000001  // Command completed signal status
// Enable 0 Masked 1 Enabled
